hmdtrack/app/views/hmds/_hmd.html.haml

    %p= hmd.company
    %p= "Current State: #{hmd.hmd_states.last.state}"
---
SELECT  "hmd_states".* FROM "hmd_states" WHERE "hmd_states"."hmd_id" = $1  ORDER BY "hmd_states"."id" DESC LIMIT 1  [["hmd_id", 3]]
SELECT "hmds".* FROM "hmds"  ORDER BY announced_at desc, name desc