hmdtrack/app/views/hmds/edit.html.haml

              .form-group
                = f.select :state, [["Announced", "announced"], ["DevKit", "devkit"], ["Released", "released"]], {}, { :class => 'form-control' }
---
SELECT "hmd_states".* FROM "hmd_states" WHERE "hmd_states"."hmd_id" = $1  [["hmd_id", 3]]

              Date
          - @hmd.hmd_states.each do |hmd_state|
---
SELECT "hmds".* FROM "hmds"  ORDER BY announced_at desc, name desc